Public Attributes | List of all members
API_RVMDocumentRevision Struct Reference
Revision Management
Represents a Document Revision. More...
#include <APIdefs_Database.h>
 Public Attributes
API_Guid  | guid
GUID of the Document Revision.
GS::UniString  | id
ID of the Document Revision.
GS::UniString  | finalId
ID with optional suffix (- WIP) of the Document Revision.
short  | userId
The member ID of the owner in TeamWork mode.
API_RVMDocumentRevisionStatusID  | status
Status of the document revision (issued or opened).
Int32  | filler
API_RVMLayoutInfo  | layoutInfo
Layout meta data.
Detailed Description
Represents a Document Revision.
Remarks
You can get all document revisions via ACAPI_Revision_GetRVMDocumentRevisions function.
Member Data Documentation
◆ filler
 Int32 API_RVMDocumentRevision::filler
◆ finalId
 API_RVMDocumentRevision::finalId
ID with optional suffix (- WIP) of the Document Revision.
◆ guid
 API_RVMDocumentRevision::guid
GUID of the Document Revision.
◆ id
 API_RVMDocumentRevision::id
ID of the Document Revision.
◆ layoutInfo
 API_RVMDocumentRevision::layoutInfo
Layout meta data.
◆ status
 API_RVMDocumentRevision::status
Status of the document revision (issued or opened).
◆ userId
 API_RVMDocumentRevision::userId
The member ID of the owner in TeamWork mode.